import { getArticleList, getArticle, createArticle, patchArticle, deleteArticle } from './ArticleService.js';
import { getProductList, getProduct, createProduct, patchProduct, deleteProduct } from './ProductService.js';


// ========================================================================================================================
// ★★★★★ getArticleList 상품 리스트 테스트 코드 ★★★★★
// ========================================================================================================================
getArticleList(1, 10, '')
  .then((data) => {
    console.log('게시글 목록:', data);
  })
  .catch((error) => {
    console.error('실행 오류:', error);
  });



// // ========================================================================================================================
// // ★★★★★ getArticle 특정 게시글 조회 테스트 코드 ★★★★★
// // ========================================================================================================================
// getArticle(6724)
//   .then((data) => {
//     console.log('특정 게시글:', data);
//   })
//   .catch((error) => {
//     console.error('실행 오류:', error);
//   });



// // ========================================================================================================================
// // ★★★★★ createArticle 게시글 생성 테스트 코드 ★★★★★ 
// // ========================================================================================================================
// const newArticle = {
//   title: '게시글 제목입니다.',
//   content: '게시글 내용입니다.',
//   image: 'https://example.com/...'
// };
// createArticle(newArticle.title, newArticle.content, newArticle.image)
//   .then((data) => {
//     console.log('생성된 게시글:', data);
//   })
//   .catch((error) => {
//     console.error('실행 오류:', error);
//   });



// // ========================================================================================================================
// // ★★★★★ patchArticle 게시글 수정 테스트 코드 ★★★★★
// // ========================================================================================================================
// const updatedArticle = {
//   title: '생성 된 게시글 수정 제목 입니다.',
//   content: '생성 된 게시글 수정 게시글 내용입니다.',
//   image: 'https://example.com/...'
// };
// patchArticle(6725, updatedArticle.title, updatedArticle.content, updatedArticle.image) 
//   .then((data) => {
//     console.log('수정된 게시글:', data);
//   })
//   .catch((error) => {
//     console.error('실행 오류:', error);
//   });



// // ========================================================================================================================
// // ★★★★★ deleteArticle 게사글 삭제 테스트 코드 ★★★★★
// // ========================================================================================================================
// deleteArticle(6725)
//   .then((data) => {
//     console.log('삭제된 게시글:', data);
//   })
//   .catch((error) => {
//     console.error('실행 오류:', error);
//   });



// // ========================================================================================================================
// // ★★★★★ getProductList 상품 리스트 조회 테스트 코드 ★★★★★
// // ========================================================================================================================
// getProductList(1, 5, '')
//   .then((data) => {
//     console.log('상품 목록:', data);
//   })
//   .catch((error) => {
//     console.error('실행 오류:', error);
//   });



// // ========================================================================================================================
// // ★★★★★ getProduct 특정 상품 조회 테스트 코드 ★★★★★
// // ========================================================================================================================
// getProduct(4081)
//   .then((data) => {
//     console.log('특정 상품:', data);
//   })
//   .catch((error) => {
//     console.error('실행 오류:', error);
//   });



// // ========================================================================================================================
// // ★★★★★ createProduct 상품 생성 테스트 코드 ★★★★★
// // ========================================================================================================================
// const newProduct = {
//   name: '상품 이름이예요.',
//   description: 'string',
//   price: 1000,
//   tags: ['태그태그'],
//   images: ['https://example.com/...']
// };
// createProduct(  newProduct.name, newProduct.description, newProduct.price, newProduct.tags, newProduct.images,)
//   .then((data) => {
//     console.log('생성된 상품:', data);
//   })
//   .catch((error) => {
//     console.error('실행 오류:', error);
//   });



// // ========================================================================================================================
// // ★★★★★ patchProduct 상품 수정 테스트 코드 ★★★★★
// // ========================================================================================================================
// const updatedProduct = {
//   name: '생성 된 상품 수정 이름입니다.',
//   description: 'string',
//   price: 20000,
//   tags: ['태그태그'],
//   images: ['https://example.com/...']
// };
// patchProduct(4086, updatedProduct.name, updatedProduct.description, updatedProduct.price, updatedProduct.tags, updatedProduct.images)
//   .then((data) => {
//     console.log('수정된 상품:', data);
//   })
//   .catch((error) => {
//     console.error('실행 오류:', error);
//   });



// // ========================================================================================================================
// // ★★★★★ deleteProduct 상품 삭제 테스트 코드 ★★★★★
// // ========================================================================================================================
// deleteProduct(4086)
//   .then((data) => {
//     console.log('삭제된 상품:', data);
//   })
//   .catch((error) => {
//     console.error('실행 오류:', error);
//   });